cospec_benchmarks/A_20250617_162558/baseline_1_8_math500_output.txt
INFO 06-17 18:36:57 [__init__.py:239] Automatically detected platform cuda.
Namespace(backend='vllm', base_url=None, host='127.0.0.1', port=8100, endpoint='/v1/completions', dataset_name='math500', dataset_path=None, max_concurrency=None, model='facebook/opt-6.7b', tokenizer=None, use_beam_search=False, num_prompts=4800, logprobs=None, request_rate=8.0, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el,token_latency', metric_percentiles='99', goodput=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None)
Loaded 500 samples from cache from HuggingFaceH4/cache/math500_facebook/opt-6.7b.json
Split dataset into 50 test samples and 450 training samples
Running test split to train selective validator...
Checking server health at http://127.0.0.1:8100/health
Server is ready!
result {'is_trained': True}
Don't need to train selective validator
Running full benchmark...
Checking server health at http://127.0.0.1:8100/health
Server is ready!
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: 8.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
Benchmark will process 4800 prompts
============ Serving Benchmark Result ============
Successful requests:                     4800      
Benchmark duration (s):                  648.18    
Total input tokens:                      350163    
Total generated tokens:                  1037944   
Request throughput (req/s):              7.41      
Output token throughput (tok/s):         1601.31   
Total Token throughput (tok/s):          2141.54   
---------------Time to First Token----------------
Mean TTFT (ms):                          2278.08   
Median TTFT (ms):                        279.92    
P99 TTFT (ms):                           18443.08  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          86.38     
Median TPOT (ms):                        84.87     
P99 TPOT (ms):                           138.54    
---------------Inter-token Latency----------------
Mean ITL (ms):                           159.26    
Median ITL (ms):                         150.87    
P99 ITL (ms):                            453.48    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          20285.50  
Median E2EL (ms):                        15666.66  
P99 E2EL (ms):                           74392.60  
-----Token Latency (e2e_latency / output_len)-----
Mean Token Latency (ms):                 104.21    
Median Token Latency (ms):               86.69     
P99 Token Latency (ms):                  357.09    
==================================================